# IsAssociatedBRepBuilderValid Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
BRepBuilderPersistentIds..::..IsAssociatedBRepBuilderValid Method
BRepBuilderPersistentIds Class See Also
---
Validates the associated (in the constructor) BRepBuilder for this BRepBuilderPersistentIds.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public bool IsAssociatedBRepBuilderValid()
```

Visual Basic
---
```text
Public Function IsAssociatedBRepBuilderValid As Boolean
```

Visual C++
---
```text
public:
bool IsAssociatedBRepBuilderValid()
```

# ### Return Value
True if the associated BRepBuilder exists, false otherwise.
# See Also
BRepBuilderPersistentIds Class
Autodesk.Revit.DB Namespace